In [5]:
import pandas as pd
df=pd.read_csv("Occupation.csv",sep='|')

In [6]:
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [7]:
df.shape

(943, 5)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [9]:
user=df

In [37]:
user.groupby('occupation')['age'].mean().reset_index()
#user.groupby('occupation')['gender'].value_counts().reset_index()

       occupation        age
0   administrator  38.746835
1          artist  31.392857
2          doctor  43.571429
3        educator  42.010526
4        engineer  36.388060
5   entertainment  29.222222
6       executive  38.718750
7      healthcare  41.562500
8       homemaker  32.571429
9          lawyer  36.750000
10      librarian  40.000000
11      marketing  37.615385
12           none  26.555556
13          other  34.523810
14     programmer  33.121212
15        retired  63.071429
16       salesman  35.666667
17      scientist  35.548387
18        student  22.081633
19     technician  33.148148
20         writer  36.311111

In [47]:
m=user[(user["gender"]=='M')]

In [48]:
m.groupby('occupation')['gender'].count().sort_values(ascending=False).reset_index()
#t.gender.count()
#df.groupby('occupation')['gender'].value_counts().unstack(fill_values=0).reset_index()
#count.columns=["",""]
#count

       occupation  gender
0         student     136
1           other      69
2        educator      69
3        engineer      65
4      programmer      60
5   administrator      43
6       executive      29
7       scientist      28
8      technician      26
9          writer      26
10      librarian      22
11  entertainment      16
12      marketing      16
13         artist      15
14        retired      13
15         lawyer      10
16       salesman       9
17         doctor       7
18     healthcare       5
19           none       5
20      homemaker       1

In [41]:
count=user.groupby('occupation')['gender'].value_counts().unstack(fill_value=0).reset_index()
count.columns=["occupation","F",'M']
count['Total']=count['F']+count['M']
count.sort_values(by='Total',ascending=False)

       occupation   F    M  Total
18        student  60  136    196
13          other  36   69    105
3        educator  26   69     95
0   administrator  36   43     79
4        engineer   2   65     67
14     programmer   6   60     66
10      librarian  29   22     51
20         writer  19   26     45
6       executive   3   29     32
17      scientist   3   28     31
1          artist  13   15     28
19     technician   1   26     27
11      marketing  10   16     26
5   entertainment   2   16     18
7      healthcare  11    5     16
15        retired   1   13     14
9          lawyer   2   10     12
16       salesman   3    9     12
12           none   4    5      9
2          doctor   0    7      7
8       homemaker   6    1      7

In [49]:
count['male%']=(count['M']*100)/count['Total']

In [50]:
count['female%']=(count['F']*100)/count['Total']

In [52]:
count.sort_values(by='Total',ascending=False)

       occupation   F    M  Total       male%    female%
18        student  60  136    196   69.387755  30.612245
13          other  36   69    105   65.714286  34.285714
3        educator  26   69     95   72.631579  27.368421
0   administrator  36   43     79   54.430380  45.569620
4        engineer   2   65     67   97.014925   2.985075
14     programmer   6   60     66   90.909091   9.090909
10      librarian  29   22     51   43.137255  56.862745
20         writer  19   26     45   57.777778  42.222222
6       executive   3   29     32   90.625000   9.375000
17      scientist   3   28     31   90.322581   9.677419
1          artist  13   15     28   53.571429  46.428571
19     technician   1   26     27   96.296296   3.703704
11      marketing  10   16     26   61.538462  38.461538
5   entertainment   2   16     18   88.888889  11.111111
7      healthcare  11    5     16   31.250000  68.750000
15        retired   1   13     14   92.857143   7.142857
9          lawyer   2   10     12   83.333333  16.666667
16       salesman   3    9     12   75.000000  25.000000
12           none   4    5      9   55.555556  44.444444
2          doctor   0    7      7  100.000000   0.000000
8       homemaker   6    1      7   14.285714  85.714286

In [66]:
user.groupby('occupation')['age'].agg(['min','max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60